# RebarConstrainedHandle Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarConstrainedHandle Members
RebarConstrainedHandle Class Methods Properties See Also
---
The RebarConstrainedHandle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RebarConstrainedHandle |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCustomHandleTag | Returns the tag of the handle. The type of the handle should be 'CustomHandle'. |
| GetEdgeNumber | If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle. |
| GetHandleName | Gets the name of the handle. |
| GetHandleType | Returns the RebarHandleType of a RebarConstrainedHandle. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsCustomHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'. |
| IsEdgeHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'. |
| IsValid | Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace